[
  {
    "name": "Coleslaw",
    "steps": [
      "Cut the cabbage, green bell pepper and onions into very tiny pieces.",
      "Scrape and shred the carrots using a grater, then use a knife to cut across the shreds to make the pieces even smaller.",
      "Put the cabbage, green pepper, green peas, onions and carrots into a large bowl and stir till you get a good mix.",
      "In a separate, smaller bowl, mix the salad cream, mayonnaise, sugar and salt.",
      "Pour the cream mix into the bowl of vegetables and stir very well.",
      "Chill and serve."
    ]
  },
  {
    "name": "Bird's Nest Salad",
    "steps": [
      "Place the diced potatoes, cucumber, grated carrots and sweet corn in a bowl and stir till everything is combined. Add the salad cream and mayonnaise and stir very well.",
      "Transfer to the serving plate",
      "Arrange the long thin lettuce around the mixture of potatoes, grated carrots, cucumber and sweet corn, leaving some space in the middle.",
      "Arrange the soft long thin carrots inside the circle created by the lettuce.",
      "Sprinkle the black pepper on top.",
      "Spray olive oil on everything (optional) then place the halved hard-boiled egg on top."
    ]
  },
  {
    "name": "Chicken Suya Salad",
    "steps": [
      "Rinse all the vegetables thoroughly.",
      "Cut the pieces of chicken suya into thin stripes with a width of about half an inch (about 1.5cm). Click the image on the right to see how I cut the ingredients.",
      "Cut thin strips of the cucumber along the fruit.",
      "Cut the tomatoes and cabbage.",
      "Arrange the vegetables like petals."
    ]
  },
  {
    "name": "Boiled Yam",
    "steps": [
      "Cut the yam tuber into 1 inch slices.",
      "Peel and cut the slices into half moons. You can leave it circular if you want. This does not make a difference to the recipe at all.",
      "Wash the slices, place in a pot and pour water to cover the contents.",
      "Boil till the yam is soft. This is when you can easily drive a fork into the slices without resistance.",
      "Add salt and leave to cook for about 2 minutes. This is so that the salt will seep into the yam slices.",
      "Turn off the heat and drain the water"
    ]
  }
]
